{
    "whoami": {
        "it": "Chi sono?",
        "en": "Who am I?"
    },
    "shortbio": {
        "it": "Benvenutə alla mia breve bio. Mi chiamo Leila Massanova, anche conosciuta online come `FallBackITA27` o più semplicemente come `FalB`.",
        "en": "Welcome to my short bio! I'm Leila Massanova, known online as `FallBackITA27` or more simply `FalB`."
    },
    "bilingual": {
        "it": "Sono bilingue, sono Italiana, nata e cresciuta in Romagna (seppur con forti nessi sia a Napoli che Perugia) e sono fluente in Inglese dai miei 10 anni, circa.",
        "en": "I'm bilingual, I'm a native Italian, born and raised in Romagna (though with strong ties to both Naples and Perugia), and I've been fluent in English ever since I was about 10 years old."
    },
    "bilingual_btn": {
        "it": "Clicca qui per cambiare lingua.",
        "en": "Click here to change language."
    },
    "coding": {
        "it": "Informatica",
        "en": "Software Engineering"
    },
    "aboutthispage": {
        "it": "Questa pagina non è esattamente la più impressionante, l'ho fatta in pochissimi minuti, ma ecco qua un paio di progetti ai quali puoi dare un'occhiata!",
        "en": "This page isn't exactly the most impressive page ever, this was thrown together in a few minutes, but here are some projects of mine you can check out!"
    },
    "mycodingexp": {
        "it": "Programmo da quando avevo 14 anni (Estate 2022), e in questo lungo lungo periodo di tempo sono stata capace di imparare molteplici linguaggi (e tecnologie).",
        "en": "I've been coding ever since I was 14 (Summer 2022), and in this long long time I've been able to learn several programming languages (and technologies)."
    },
    "whatis_mkitalia": {
        "it": "MKItalia è il sito di classifiche italiane inerente a tutti i Mario Kart. Si tratta del progetto principale a cui lavoro, completamente da sola. Seppur incompleto e la mia pausa dal progetto non lo aiuta a crescere, penso sia una dimostrazione delle mie abilità.",
        "en": "MKItalia is the website that contains the Italian leaderboards of every Mario Kart. It's the main project I work on, despite being completely alone. Even though it's not complete, and my recent break from it doesn't help it grow, I think it's a testament to my skills."
    },
    "whatis_gtaocompanion": {
        "it": "In una dimostrazione di pura pazzia nel frontend, questo è il mio secondo progetto per grandezza ad oggi. Una mappa completamente interattiva di GTA Online, con una GUI fatta per assistere l'utente nelle mansioni più meccaniche del gioco.",
        "en": "In a demonstration of pure frontend madness, this is my second biggest project to date. A fully interactive map of GTA Online, which has a GUI made for assisting the user in the most mechanical tasks of the game."
    },
    "activism": {
        "it": "Attivismo",
        "en": "Activism"
    },
    "about_activism": {
        "it": "Sono sempre stata e probabilmente sempre sarò un'Anarcocomunista. Ho svolto molteplici studi negli anni per quanto riguarda la teoria politica e non ho mai avuto paura di nasconderlo. Sono un'attivista e militante per OSA Ravenna. Sono una donna trans, il che m'ha regalato un sacco d'esperienza legata alla oppressione e all'odio, i quali devo ad oggi ancora soffrire all'interno del mio stesso domicilio.",
        "en": "I always have been and probably always will be an Anarchocommunist. I spent many years studying the theory behind politics and I never had much fear in hiding it. I'm an activist and militant for OSA Ravenna. I'm a transwoman, which has gifted me with a ton of experience related to oppression and hatred, which I had to and still endure inside my own household."
    },
    "school": {
        "it": "Scuola",
        "en": "School"
    },
    "about_school": {
        "it": "Ho svolto un anno di Liceo Linguistico all'Ilaria Alpi di Cesena, dove mi bocciarono; mi trovai male coi professori e litigai abbastanza spesso particolarmente con le prof di Francese, di Italiano e di Latino. Per quanto io sia ancora interessata nelle materie, mi trovai sott'obbligo di cambiare scuola, e mi misi al ITIS di Ravenna, dove ho passato il primo anno, e sono stata bocciata in seconda sempre per problemi personali. Pianifico di tornarci ad inizio anno scolastico 2024/2025, quando alcuni di questi problemi dovrebbero esser stati alleviati parecchio.",
        "en": "I did a year of Linguistics Lyceum at the Ilaria Alpi of Cesena, where I got flunked; I had several issues with my professors and I would argue a lot with my French, Italian and Latin professors. Although I'm still highly interested in those subjects, I found myself under the obligation to change school, and I got myself into the ITIS of Ravenna, where I passed my first year, and got flunked on the second year due to personal issues. I plan to come back to it at the start of the 2024/2025 school year, as some of these issues should be solved."
    },
    "music": {
        "it": "Musica",
        "en": "Music"
    },
    "about_music": {
        "it": "Sono immersa nel rap da minimo 5 anni. Ho ascoltato un po' a tutti i rapper a cui uno possa pensare; da Eazy-E a Lupe Fiasco. Ora come ora sono in una fase Kendrick, avendo ricominciato ad amare DAMN. un'ennesima volta. Si, in casa mia si ascolta Not Like Us.",
        "en": "I've been knee-deep into rap for the past 5 years of my life. I've listened to just about anything; from Eazy-E to Lupe Fiasco. Right now I'm in a Kendrick Lamar phase, having fall in love again with his album DAMN. Yes, in this house we bump Not Like Us."
    }
}